Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeTextGraphic
The Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeTextGraphic class is a Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic for text.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeTextGraphic.#ctor(System.String,Tekla.Common.Geometry.Segment3,Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t,Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t,System.Boolean)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeTextGraphic class.
text: The text of the graphic.
location: The location of the graphic.
color: The color of the graphic.
background: The background color.
isInteractive: A value indicating whether the text is interactive.
Throws System.ArgumentOutOfRangeException: text - The text string cannot have more than " + dotTemporaryDrawText_t.MaxTextLength + " characters.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeTextGraphic.BackgroundColor
Gets the background color of the Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeTextGraphic.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeTextGraphic.Location
Gets the location of the graphic.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeTextGraphic.Text
Gets the text of the graphic.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeTextGraphic.IsInteractive
Gets a value indicating whether the text is interactive.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeTextGraphic.Draw(System.Int32,Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsViewInfo)
Draws the graphic.
identifier: The identifier to use when drawing the graphic.
view: The Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo describing the view to draw to.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeTextGraphic.DotExportDMDrawTemporaryText(Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotTemporaryDrawText_t@)
Exports the draw temporary text command.
argument: The argument.
Returns: Greater than 0 on success.